Revit 2024 API
FilteredWorksetCollector.ToWorksetIds Method
 Returns the complete set of workset ids that pass the filter(s).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ICollection<WorksetId> ToWorksetIds()
Visual Basic
Public Function ToWorksetIds As ICollection(Of WorksetId)
Visual C++
public:
ICollection<WorksetId^>^ ToWorksetIds()
Return Value
 The complete set of workset ids.
Remarks
 This will reset the collector to the beginning and extract all worksets that pass the applied filter(s). If you have an active iterator to this same collector it will be stopped by this call.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The collector does not have a filter applied. Extraction or iteration of worksets is not permitted without a filter.
See Also
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace